#Область НаборТестов

&НаКлиенте
Процедура ЗаполнитьНаборТестов(ЮнитТест, Интерактивно = Ложь) Экспорт
	
	ЮнитТест.Добавить("Тест_РаспознатьИзображение", "Распознать изображение");
	
КонецПроцедуры

#КонецОбласти

#Область GherkinParser

&НаКлиенте
Процедура Тест_РаспознатьИзображение(Ожидается) Экспорт
	
	ДанныеФайла = Новый ДвоичныеДанные(ФайлКартинки);
	ВК = Ожидается.Тест().Компонента("TesseractOCR").Вернуть();
	Ожидается.Тест().Что(ВК).Функц("Инициализировать", ЯзыковыеФайлы, "rus+eng").Равно(Истина);
	Текст = Ожидается.Тест().Что(ВК).Функц("Распознать", ДанныеФайла).XML().Получить("PrintSpace", "ComposedBlock").Вернуть();
	Ожидается.Тест().Что(Текст).Получить(2, "TextBlock", "TextLine", "String", 2, "CONTENT").Равно("Распознавание");
	Ожидается.Тест().Что(Текст).Получить(14, "TextBlock", "TextLine", "String", 0, "CONTENT").Равно("Текст");
	Ожидается.Тест().Что(Текст).Получить(14, "TextBlock", "TextLine", "String", 1, "CONTENT").Равно("XML:");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Файл = Новый Файл(ОбработкаОбъект.ИспользуемоеИмяФайла);
	ЯзыковыеФайлы = Файл.Путь + ПолучитьРазделительПути() + "tessdata";
	ФайлКартинки = Файл.Путь + "testfile.png";
	
КонецПроцедуры
